Autodesk.Revit.DB.BuiltInFailures.MacroFailures.DuplicateModuleName
Macro project with name [MacroModuleName] duplicates with central file. Delete the macro project or re-create it with another name to proceed.

Autodesk.Revit.DB.BuiltInFailures.MacroFailures
Failures about module with duplicate name found during reload latest.